Public Member Functions | Friends | List of all members
ACAPI::MEP::BranchUIManager Class Referencefinal
MEP Element Manager
The BranchUIManager contains UI-related services for a Branch. More...
#include <MEPBranchUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::BranchUIManager:
 Public Member Functions
Result< BranchDefault >  | CreateBranchDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a BranchDefault from a toolUIData.
Result< void >  | ApplyBranchDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const BranchDefault &branchDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< BranchUIManager >  | CreateBranchUIManager ()
Creates a BranchUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The BranchUIManager contains UI-related services for a Branch.
Since
Archicad 28
Member Function Documentation
◆ ApplyBranchDefaultToToolUIData()
 Result< void > ACAPI::MEP::BranchUIManager::ApplyBranchDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const BranchDefault & |  branchDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
branchDefault | The default to be set
Returns
Returns error if the BranchDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateBranchDefaultFromToolUIData()
 Result< BranchDefault > ACAPI::MEP::BranchUIManager::CreateBranchDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a BranchDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Branch in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an BranchDefault, otherwise returns the BranchDefault created from it.
Friends And Related Symbol Documentation
◆ CreateBranchUIManager
 Result< BranchUIManager > CreateBranchUIManager  |  ( |   | )
friend
Creates a BranchUIManager.
Returns
If able, creates a new manager for Branch, otherwise Error.